<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-postgres-registry","backend_type":"remote","backend":"1ddf8e5aaf7341e06532696ea44658ad6bb8f911eeb33c8a27bda5ead6f48619","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #273 at https://github.com/scidsg/hushline/actions/runs/10908224214","plan_out_hash":"bf7e86055beec1fbb45baf5aeda8f42dcd1ed0d190c7375298b517f855625549","plan_hash":"fd774dad1b4bfa5f16b6c960b85c88b33df72531f064909dad575d0678c8db16","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-postgres-registry__ workspace<details open><summary>With variables</summary>

```hcl
branch = "postgres-registry"
name   = "dev-postgres-registry"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = "************************************"
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "dev-postgres-registry"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "postgres-registry"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }

+           worker {
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               name               = "db"

+               image {
+                   registry      = "library"
+                   registry_type = "DOCKER_HUB"
+                   repository    = "postgres"
+                   tag           = "16.4-alpine3.20"

+                   deploy_on_push (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #273](https://github.com/scidsg/hushline/actions/runs/10908224214)